espressif/esp-idf/components/soc/esp32h4/register/hw_ver_mp/soc/interrupt_matrix_struct.h
/** Type of hp_peri_timeout_intr_map register
 *  HP_PERI_TIMEOUT_INTR mapping register
 */
typedef union {
    struct {
        /** hp_peri_timeout_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_peri_timeout_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_peri_timeout_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t hp_peri_timeout_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_hp_peri_timeout_intr_map_reg_t;

/** Type of hp_apm_m0_intr_map register
 *  HP_APM_M0_INTR mapping register
 */
typedef union {
    struct {
        /** hp_apm_m0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_apm_m0_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_apm_m0_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t hp_apm_m0_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_hp_apm_m0_intr_map_reg_t;

/** Type of hp_apm_m1_intr_map register
 *  HP_APM_M1_INTR mapping register
 */
typedef union {
    struct {
        /** hp_apm_m1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_apm_m1_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_apm_m1_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t hp_apm_m1_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_hp_apm_m1_intr_map_reg_t;

/** Type of hp_apm_m2_intr_map register
 *  HP_APM_M2_INTR mapping register
 */
typedef union {
    struct {
        /** hp_apm_m2_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_apm_m2_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_apm_m2_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t hp_apm_m2_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_hp_apm_m2_intr_map_reg_t;

/** Type of hp_apm_m3_intr_map register
 *  HP_APM_M3_INTR mapping register
 */
typedef union {
    struct {
        /** hp_apm_m3_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_apm_m3_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_apm_m3_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t hp_apm_m3_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_hp_apm_m3_intr_map_reg_t;

/** Type of hp_apm_m4_intr_map register
 *  HP_APM_M4_INTR mapping register
 */
typedef union {
    struct {
        /** hp_apm_m4_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_apm_m4_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_apm_m4_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t hp_apm_m4_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_hp_apm_m4_intr_map_reg_t;

/** Type of hp_mem_apm_m0_intr_map register
 *  HP_MEM_APM_M0_INTR mapping register
 */
typedef union {
    struct {
        /** hp_mem_apm_m0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_mem_apm_m0_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_mem_apm_m0_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t hp_mem_apm_m0_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_hp_mem_apm_m0_intr_map_reg_t;

/** Type of hp_mem_apm_m1_intr_map register
 *  HP_MEM_APM_M1_INTR mapping register
 */
typedef union {
    struct {
        /** hp_mem_apm_m1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_mem_apm_m1_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_mem_apm_m1_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t hp_mem_apm_m1_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_hp_mem_apm_m1_intr_map_reg_t;

/** Type of hp_mem_apm_m2_intr_map register
 *  HP_MEM_APM_M2_INTR mapping register
 */
typedef union {
    struct {
        /** hp_mem_apm_m2_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_mem_apm_m2_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_mem_apm_m2_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t hp_mem_apm_m2_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_hp_mem_apm_m2_intr_map_reg_t;

/** Type of hp_mem_apm_m3_intr_map register
 *  HP_MEM_APM_M3_INTR mapping register
 */
typedef union {
    struct {
        /** hp_mem_apm_m3_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_mem_apm_m3_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_mem_apm_m3_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t hp_mem_apm_m3_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_hp_mem_apm_m3_intr_map_reg_t;

/** Type of cpu_apm_m0_intr_map register
 *  CPU_APM_M0_INTR mapping register
 */
typedef union {
    struct {
        /** cpu_apm_m0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t cpu_apm_m0_intr_map:6;
        uint32_t reserved_6:2;
        /** cpu_apm_m0_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t cpu_apm_m0_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_cpu_apm_m0_intr_map_reg_t;

/** Type of cpu_apm_m1_intr_map register
 *  CPU_APM_M1_INTR mapping register
 */
typedef union {
    struct {
        /** cpu_apm_m1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t cpu_apm_m1_intr_map:6;
        uint32_t reserved_6:2;
        /** cpu_apm_m1_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t cpu_apm_m1_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_cpu_apm_m1_intr_map_reg_t;

