espressif/esp-idf/components/soc/esp32h4/register/hw_ver_mp/soc/interrupt_matrix_struct.h
/** Type of cpu_apm_m2_intr_map register
 *  CPU_APM_M2_INTR mapping register
 */
typedef union {
    struct {
        /** cpu_apm_m2_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t cpu_apm_m2_intr_map:6;
        uint32_t reserved_6:2;
        /** cpu_apm_m2_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t cpu_apm_m2_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_cpu_apm_m2_intr_map_reg_t;

/** Type of cpu_apm_m3_intr_map register
 *  CPU_APM_M3_INTR mapping register
 */
typedef union {
    struct {
        /** cpu_apm_m3_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t cpu_apm_m3_intr_map:6;
        uint32_t reserved_6:2;
        /** cpu_apm_m3_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t cpu_apm_m3_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_cpu_apm_m3_intr_map_reg_t;

/** Type of hp_peri_pms_intr_map register
 *  HP_PERI_PMS_INTR mapping register
 */
typedef union {
    struct {
        /** hp_peri_pms_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t hp_peri_pms_intr_map:6;
        uint32_t reserved_6:2;
        /** hp_peri_pms_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t hp_peri_pms_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_hp_peri_pms_intr_map_reg_t;

/** Type of modem_peri_pms_intr_map register
 *  MODEM_PERI_PMS_INTR mapping register
 */
typedef union {
    struct {
        /** modem_peri_pms_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t modem_peri_pms_intr_map:6;
        uint32_t reserved_6:2;
        /** modem_peri_pms_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t modem_peri_pms_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_modem_peri_pms_intr_map_reg_t;

/** Type of cpu_peri_pms_intr_map register
 *  CPU_PERI_PMS_INTR mapping register
 */
typedef union {
    struct {
        /** cpu_peri_pms_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t cpu_peri_pms_intr_map:6;
        uint32_t reserved_6:2;
        /** cpu_peri_pms_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t cpu_peri_pms_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_cpu_peri_pms_intr_map_reg_t;

/** Type of mspi_intr_map register
 *  MSPI_INTR mapping register
 */
typedef union {
    struct {
        /** mspi_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t mspi_intr_map:6;
        uint32_t reserved_6:2;
        /** mspi_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t mspi_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_mspi_intr_map_reg_t;

/** Type of i2s_intr_map register
 *  I2S_INTR mapping register
 */
typedef union {
    struct {
        /** i2s_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t i2s_intr_map:6;
        uint32_t reserved_6:2;
        /** i2s_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t i2s_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_i2s_intr_map_reg_t;

/** Type of uhci0_intr_map register
 *  UHCI0_INTR mapping register
 */
typedef union {
    struct {
        /** uhci0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t uhci0_intr_map:6;
        uint32_t reserved_6:2;
        /** uhci0_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t uhci0_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_uhci0_intr_map_reg_t;

/** Type of uart0_intr_map register
 *  UART0_INTR mapping register
 */
typedef union {
    struct {
        /** uart0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t uart0_intr_map:6;
        uint32_t reserved_6:2;
        /** uart0_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t uart0_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_uart0_intr_map_reg_t;

/** Type of uart1_intr_map register
 *  UART1_INTR mapping register
 */
typedef union {
    struct {
        /** uart1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t uart1_intr_map:6;
        uint32_t reserved_6:2;
        /** uart1_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t uart1_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_uart1_intr_map_reg_t;

/** Type of ledc_intr_map register
 *  LEDC_INTR mapping register
 */
typedef union {
    struct {
        /** ledc_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ledc_intr_map:6;
        uint32_t reserved_6:2;
        /** ledc_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t ledc_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_ledc_intr_map_reg_t;

/** Type of can0_intr_map register
 *  CAN0_INTR mapping register
 */
typedef union {
    struct {
        /** can0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t can0_intr_map:6;
        uint32_t reserved_6:2;
        /** can0_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t can0_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_can0_intr_map_reg_t;

/** Type of can0_timer_intr_map register
 *  CAN0_TIMER_INTR mapping register
 */
typedef union {
    struct {
        /** can0_timer_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t can0_timer_intr_map:6;
        uint32_t reserved_6:2;
        /** can0_timer_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t can0_timer_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_can0_timer_intr_map_reg_t;

/** Type of usb_serial_jtag_intr_map register
 *  USB_SERIAL_JTAG_INTR mapping register
 */
typedef union {
    struct {
        /** usb_serial_jtag_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t usb_serial_jtag_intr_map:6;
        uint32_t reserved_6:2;
        /** usb_serial_jtag_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t usb_serial_jtag_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_usb_serial_jtag_intr_map_reg_t;

