espressif/esp-idf/components/soc/esp32h4/register/hw_ver_mp/soc/interrupt_matrix_struct.h
/** Type of asrc_chnl0_intr_map register
 *  ASRC_CHNL0_INTR mapping register
 */
typedef union {
    struct {
        /** asrc_chnl0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t asrc_chnl0_intr_map:6;
        uint32_t reserved_6:2;
        /** asrc_chnl0_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t asrc_chnl0_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_asrc_chnl0_intr_map_reg_t;

/** Type of asrc_chnl1_intr_map register
 *  ASRC_CHNL1_INTR mapping register
 */
typedef union {
    struct {
        /** asrc_chnl1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t asrc_chnl1_intr_map:6;
        uint32_t reserved_6:2;
        /** asrc_chnl1_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t asrc_chnl1_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_asrc_chnl1_intr_map_reg_t;

/** Type of zero_det_intr_map register
 *  ZERO_DET_INTR mapping register
 */
typedef union {
    struct {
        /** zero_det_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t zero_det_intr_map:6;
        uint32_t reserved_6:2;
        /** zero_det_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t zero_det_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_zero_det_intr_map_reg_t;

/** Type of dma_in_ch0_intr_map register
 *  DMA_IN_CH0_INTR mapping register
 */
typedef union {
    struct {
        /** dma_in_ch0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma_in_ch0_intr_map:6;
        uint32_t reserved_6:2;
        /** dma_in_ch0_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t dma_in_ch0_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_dma_in_ch0_intr_map_reg_t;

/** Type of dma_in_ch1_intr_map register
 *  DMA_IN_CH1_INTR mapping register
 */
typedef union {
    struct {
        /** dma_in_ch1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma_in_ch1_intr_map:6;
        uint32_t reserved_6:2;
        /** dma_in_ch1_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t dma_in_ch1_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_dma_in_ch1_intr_map_reg_t;

/** Type of dma_in_ch2_intr_map register
 *  DMA_IN_CH2_INTR mapping register
 */
typedef union {
    struct {
        /** dma_in_ch2_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma_in_ch2_intr_map:6;
        uint32_t reserved_6:2;
        /** dma_in_ch2_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t dma_in_ch2_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_dma_in_ch2_intr_map_reg_t;

/** Type of dma_in_ch3_intr_map register
 *  DMA_IN_CH3_INTR mapping register
 */
typedef union {
    struct {
        /** dma_in_ch3_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma_in_ch3_intr_map:6;
        uint32_t reserved_6:2;
        /** dma_in_ch3_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t dma_in_ch3_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_dma_in_ch3_intr_map_reg_t;

/** Type of dma_in_ch4_intr_map register
 *  DMA_IN_CH4_INTR mapping register
 */
typedef union {
    struct {
        /** dma_in_ch4_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma_in_ch4_intr_map:6;
        uint32_t reserved_6:2;
        /** dma_in_ch4_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t dma_in_ch4_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_dma_in_ch4_intr_map_reg_t;

/** Type of dma_out_ch0_intr_map register
 *  DMA_OUT_CH0_INTR mapping register
 */
typedef union {
    struct {
        /** dma_out_ch0_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma_out_ch0_intr_map:6;
        uint32_t reserved_6:2;
        /** dma_out_ch0_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t dma_out_ch0_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_dma_out_ch0_intr_map_reg_t;

/** Type of dma_out_ch1_intr_map register
 *  DMA_OUT_CH1_INTR mapping register
 */
typedef union {
    struct {
        /** dma_out_ch1_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma_out_ch1_intr_map:6;
        uint32_t reserved_6:2;
        /** dma_out_ch1_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t dma_out_ch1_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_dma_out_ch1_intr_map_reg_t;

/** Type of dma_out_ch2_intr_map register
 *  DMA_OUT_CH2_INTR mapping register
 */
typedef union {
    struct {
        /** dma_out_ch2_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma_out_ch2_intr_map:6;
        uint32_t reserved_6:2;
        /** dma_out_ch2_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t dma_out_ch2_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_dma_out_ch2_intr_map_reg_t;

/** Type of dma_out_ch3_intr_map register
 *  DMA_OUT_CH3_INTR mapping register
 */
typedef union {
    struct {
        /** dma_out_ch3_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma_out_ch3_intr_map:6;
        uint32_t reserved_6:2;
        /** dma_out_ch3_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t dma_out_ch3_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_dma_out_ch3_intr_map_reg_t;

/** Type of dma_out_ch4_intr_map register
 *  DMA_OUT_CH4_INTR mapping register
 */
typedef union {
    struct {
        /** dma_out_ch4_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t dma_out_ch4_intr_map:6;
        uint32_t reserved_6:2;
        /** dma_out_ch4_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t dma_out_ch4_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_dma_out_ch4_intr_map_reg_t;

/** Type of gpspi2_intr_map register
 *  GPSPI2_INTR mapping register
 */
typedef union {
    struct {
        /** gpspi2_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t gpspi2_intr_map:6;
        uint32_t reserved_6:2;
        /** gpspi2_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t gpspi2_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_gpspi2_intr_map_reg_t;

/** Type of gpspi3_intr_map register
 *  GPSPI3_INTR mapping register
 */
typedef union {
    struct {
        /** gpspi3_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t gpspi3_intr_map:6;
        uint32_t reserved_6:2;
        /** gpspi3_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t gpspi3_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_gpspi3_intr_map_reg_t;

/** Type of aes_intr_map register
 *  AES_INTR mapping register
 */
typedef union {
    struct {
        /** aes_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t aes_intr_map:6;
        uint32_t reserved_6:2;
        /** aes_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t aes_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_aes_intr_map_reg_t;

/** Type of sha_intr_map register
 *  SHA_INTR mapping register
 */
typedef union {
    struct {
        /** sha_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t sha_intr_map:6;
        uint32_t reserved_6:2;
        /** sha_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t sha_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_sha_intr_map_reg_t;

/** Type of ecc_intr_map register
 *  ECC_INTR mapping register
 */
typedef union {
    struct {
        /** ecc_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ecc_intr_map:6;
        uint32_t reserved_6:2;
        /** ecc_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t ecc_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_ecc_intr_map_reg_t;

