espressif/esp-idf/components/soc/esp32h4/register/hw_ver_mp/soc/interrupt_matrix_struct.h
/** Type of ecdsa_intr_map register
 *  ECDSA_INTR mapping register
 */
typedef union {
    struct {
        /** ecdsa_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t ecdsa_intr_map:6;
        uint32_t reserved_6:2;
        /** ecdsa_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t ecdsa_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_ecdsa_intr_map_reg_t;

/** Type of km_intr_map register
 *  KM_INTR mapping register
 */
typedef union {
    struct {
        /** km_intr_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t km_intr_map:6;
        uint32_t reserved_6:2;
        /** km_intr_pass_in_sec : R/W; bitpos: [8]; default: 0;
         *  Configures the PASS_IN_SEC flag of the interrupt source.
         */
        uint32_t km_intr_pass_in_sec:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} interrupt_core0_km_intr_map_reg_t;

/** Type of sig_idx_assert_in_sec register
 *  reserved
 */
typedef union {
    struct {
        /** int_sig_idx_assert_in_sec : R/W; bitpos: [5:0]; default: 0;
         *  reserved
         */
        uint32_t int_sig_idx_assert_in_sec:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} interrupt_core0_sig_idx_assert_in_sec_reg_t;

/** Type of clock_gate register
 *  Interrupt clock gating configure register
 */
typedef union {
    struct {
        /** reg_clk_en : R/W; bitpos: [0]; default: 0;
         *  Interrupt clock gating configure register
         */
        uint32_t reg_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} interrupt_core0_clock_gate_reg_t;


/** Group: Status Registers */
/** Type of int_status_reg_0 register
 *  Status register for interrupt sources 0 ~ 31
 */
typedef union {
    struct {
        /** int_status_0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the status of the interrupt sources within interrupt-index-range 0 ~ 31.
         *  Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source triggered an interrupt
         *  1:No interrupt triggered
         */
        uint32_t int_status_0:32;
    };
    uint32_t val;
} interrupt_core0_int_status_reg_0_reg_t;

/** Type of int_status_reg_1 register
 *  Status register for interrupt sources 32 ~ 63
 */
typedef union {
    struct {
        /** int_status_1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the status of the interrupt sources within interrupt-index-range 32 ~
         *  63. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source triggered an interrupt
         *  1:No interrupt triggered
         */
        uint32_t int_status_1:32;
    };
    uint32_t val;
} interrupt_core0_int_status_reg_1_reg_t;

/** Type of int_status_reg_2 register
 *  Status register for interrupt sources 64 ~ 95
 */
typedef union {
    struct {
        /** int_status_2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the status of the interrupt sources within interrupt-index-range 64 ~
         *  95. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source triggered an interrupt
         *  1:No interrupt triggered
         */
        uint32_t int_status_2:32;
    };
    uint32_t val;
} interrupt_core0_int_status_reg_2_reg_t;

/** Type of int_status_reg_3 register
 *  Status register for interrupt sources 96 ~ 97
 */
typedef union {
    struct {
        /** int_status_3 : RO; bitpos: [1:0]; default: 0;
         *  Represents the status of the interrupt sources within interrupt-index-range 96 ~
         *  97. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source triggered an interrupt
         *  1:No interrupt triggered
         */
        uint32_t int_status_3:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} interrupt_core0_int_status_reg_3_reg_t;

/** Type of src_pass_in_sec_status_0 register
 *  PASS_IN_SEC status register for interrupt sources 0 ~ 31
 */
typedef union {
    struct {
        /** int_src_pass_in_sec_status_0 : RO; bitpos: [31:0]; default: 0;
         *  Represents the PASS_IN_SEC status of the interrupt sources within
         *  interrupt-index-range 0 ~ 31. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS_IN_SEC.
         *  1:The corresponding interrupt source is PASS_IN_SEC.
         */
        uint32_t int_src_pass_in_sec_status_0:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_sec_status_0_reg_t;

/** Type of src_pass_in_sec_status_1 register
 *  PASS_IN_SEC status register for interrupt sources 32 ~ 63
 */
typedef union {
    struct {
        /** int_src_pass_in_sec_status_1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the PASS_IN_SEC status of the interrupt sources within
         *  interrupt-index-range 32 ~ 63. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS_IN_SEC.
         *  1:The corresponding interrupt source is PASS_IN_SEC.
         */
        uint32_t int_src_pass_in_sec_status_1:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_sec_status_1_reg_t;

/** Type of src_pass_in_sec_status_2 register
 *  PASS_IN_SEC status register for interrupt sources 64 ~ 95
 */
typedef union {
    struct {
        /** int_src_pass_in_sec_status_2 : RO; bitpos: [31:0]; default: 0;
         *  Represents the PASS_IN_SEC status of the interrupt sources within
         *  interrupt-index-range 64 ~ 95. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS_IN_SEC.
         *  1:The corresponding interrupt source is PASS_IN_SEC.
         */
        uint32_t int_src_pass_in_sec_status_2:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_sec_status_2_reg_t;

