espressif/esp-idf/components/soc/esp32h4/register/hw_ver_mp/soc/interrupt_matrix_struct.h
/** Type of src_pass_in_sec_status_3 register
 *  PASS_IN_SEC status register for interrupt sources 96 ~ 97
 */
typedef union {
    struct {
        /** int_src_pass_in_sec_status_3 : RO; bitpos: [1:0]; default: 0;
         *  Represents the PASS_IN_SEC status of the interrupt sources with
         *  interrupt-index-range 96 ~ 97. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS_IN_SEC.
         *  1:The corresponding interrupt source is PASS_IN_SEC.
         */
        uint32_t int_src_pass_in_sec_status_3:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_sec_status_3_reg_t;

/** Type of secure_status register
 *  reserved
 */
typedef union {
    struct {
        /** int_secure_status : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t int_secure_status:32;
    };
    uint32_t val;
} interrupt_core0_secure_status_reg_t;


/** Group: Version Register */
/** Type of interrupt_date register
 *  Version control register
 */
typedef union {
    struct {
        /** interrupt_date : R/W; bitpos: [27:0]; default: 38813760;
         *  Version control register
         */
        uint32_t interrupt_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} interrupt_core0_interrupt_date_reg_t;


typedef struct {
    volatile interrupt_core0_wifi_mac_intr_map_reg_t wifi_mac_intr_map;
    volatile interrupt_core0_wifi_mac_nmi_map_reg_t wifi_mac_nmi_map;
    volatile interrupt_core0_wifi_pwr_intr_map_reg_t wifi_pwr_intr_map;
    volatile interrupt_core0_wifi_bb_intr_map_reg_t wifi_bb_intr_map;
    volatile interrupt_core0_bt_mac_intr_map_reg_t bt_mac_intr_map;
    volatile interrupt_core0_bt_bb_intr_map_reg_t bt_bb_intr_map;
    volatile interrupt_core0_bt_bb_nmi_map_reg_t bt_bb_nmi_map;
    volatile interrupt_core0_lp_timer_intr_map_reg_t lp_timer_intr_map;
    volatile interrupt_core0_coex_intr_map_reg_t coex_intr_map;
    volatile interrupt_core0_ble_timer_intr_map_reg_t ble_timer_intr_map;
    volatile interrupt_core0_ble_sec_intr_map_reg_t ble_sec_intr_map;
    volatile interrupt_core0_i2c_mst_intr_map_reg_t i2c_mst_intr_map;
    volatile interrupt_core0_zb_mac_intr_map_reg_t zb_mac_intr_map;
    volatile interrupt_core0_modem_apb_timeout_intr_map_reg_t modem_apb_timeout_intr_map;
    volatile interrupt_core0_bt_mac_int1_map_reg_t bt_mac_int1_map;
    volatile interrupt_core0_pmu_intr_map_reg_t pmu_intr_map;
    volatile interrupt_core0_efuse_intr_map_reg_t efuse_intr_map;
    volatile interrupt_core0_lp_rtc_timer_intr_map_reg_t lp_rtc_timer_intr_map;
    volatile interrupt_core0_lp_rtc_ble_timer_intr_map_reg_t lp_rtc_ble_timer_intr_map;
    volatile interrupt_core0_lp_wdt_intr_map_reg_t lp_wdt_intr_map;
    volatile interrupt_core0_touch_intr_map_reg_t touch_intr_map;
    volatile interrupt_core0_huk_intr_map_reg_t huk_intr_map;
    volatile interrupt_core0_lp_peri_pms_intr_map_reg_t lp_peri_pms_intr_map;
    volatile interrupt_core0_cpu_intr_from_cpu_0_map_reg_t cpu_intr_from_cpu_0_map;
    volatile interrupt_core0_cpu_intr_from_cpu_1_map_reg_t cpu_intr_from_cpu_1_map;
    volatile interrupt_core0_cpu_intr_from_cpu_2_map_reg_t cpu_intr_from_cpu_2_map;
    volatile interrupt_core0_cpu_intr_from_cpu_3_map_reg_t cpu_intr_from_cpu_3_map;
    volatile interrupt_core0_bus_monitor_intr_map_reg_t bus_monitor_intr_map;
    volatile interrupt_core0_core0_trace_intr_map_reg_t core0_trace_intr_map;
    volatile interrupt_core0_core1_trace_intr_map_reg_t core1_trace_intr_map;
    volatile interrupt_core0_cache_intr_map_reg_t cache_intr_map;
    volatile interrupt_core0_cpu_peri_timeout_intr_map_reg_t cpu_peri_timeout_intr_map;
    volatile interrupt_core0_gpio_interrupt_pro_map_reg_t gpio_interrupt_pro_map;
    volatile interrupt_core0_gpio_interrupt_2_map_reg_t gpio_interrupt_2_map;
    volatile interrupt_core0_pau_intr_map_reg_t pau_intr_map;
    volatile interrupt_core0_hp_peri_timeout_intr_map_reg_t hp_peri_timeout_intr_map;
    volatile interrupt_core0_hp_apm_m0_intr_map_reg_t hp_apm_m0_intr_map;
    volatile interrupt_core0_hp_apm_m1_intr_map_reg_t hp_apm_m1_intr_map;
    volatile interrupt_core0_hp_apm_m2_intr_map_reg_t hp_apm_m2_intr_map;
    volatile interrupt_core0_hp_apm_m3_intr_map_reg_t hp_apm_m3_intr_map;
    volatile interrupt_core0_hp_apm_m4_intr_map_reg_t hp_apm_m4_intr_map;
    volatile interrupt_core0_hp_mem_apm_m0_intr_map_reg_t hp_mem_apm_m0_intr_map;
    volatile interrupt_core0_hp_mem_apm_m1_intr_map_reg_t hp_mem_apm_m1_intr_map;
    volatile interrupt_core0_hp_mem_apm_m2_intr_map_reg_t hp_mem_apm_m2_intr_map;
    volatile interrupt_core0_hp_mem_apm_m3_intr_map_reg_t hp_mem_apm_m3_intr_map;
    volatile interrupt_core0_cpu_apm_m0_intr_map_reg_t cpu_apm_m0_intr_map;
    volatile interrupt_core0_cpu_apm_m1_intr_map_reg_t cpu_apm_m1_intr_map;
    volatile interrupt_core0_cpu_apm_m2_intr_map_reg_t cpu_apm_m2_intr_map;
    volatile interrupt_core0_cpu_apm_m3_intr_map_reg_t cpu_apm_m3_intr_map;
    volatile interrupt_core0_hp_peri_pms_intr_map_reg_t hp_peri_pms_intr_map;
    volatile interrupt_core0_modem_peri_pms_intr_map_reg_t modem_peri_pms_intr_map;
    volatile interrupt_core0_cpu_peri_pms_intr_map_reg_t cpu_peri_pms_intr_map;
    volatile interrupt_core0_mspi_intr_map_reg_t mspi_intr_map;
    volatile interrupt_core0_i2s_intr_map_reg_t i2s_intr_map;
    volatile interrupt_core0_uhci0_intr_map_reg_t uhci0_intr_map;
    volatile interrupt_core0_uart0_intr_map_reg_t uart0_intr_map;
    volatile interrupt_core0_uart1_intr_map_reg_t uart1_intr_map;
    volatile interrupt_core0_ledc_intr_map_reg_t ledc_intr_map;
    volatile interrupt_core0_can0_intr_map_reg_t can0_intr_map;
    volatile interrupt_core0_can0_timer_intr_map_reg_t can0_timer_intr_map;
    volatile interrupt_core0_usb_serial_jtag_intr_map_reg_t usb_serial_jtag_intr_map;
    volatile interrupt_core0_rmt_intr_map_reg_t rmt_intr_map;
    volatile interrupt_core0_i2c_ext0_intr_map_reg_t i2c_ext0_intr_map;
    volatile interrupt_core0_i2c_ext1_intr_map_reg_t i2c_ext1_intr_map;
    volatile interrupt_core0_tg0_t0_intr_map_reg_t tg0_t0_intr_map;
    volatile interrupt_core0_tg0_wdt_intr_map_reg_t tg0_wdt_intr_map;
    volatile interrupt_core0_tg1_t0_intr_map_reg_t tg1_t0_intr_map;
    volatile interrupt_core0_tg1_wdt_intr_map_reg_t tg1_wdt_intr_map;
    volatile interrupt_core0_systimer_target0_intr_map_reg_t systimer_target0_intr_map;
    volatile interrupt_core0_systimer_target1_intr_map_reg_t systimer_target1_intr_map;
    volatile interrupt_core0_systimer_target2_intr_map_reg_t systimer_target2_intr_map;
    volatile interrupt_core0_apb_adc_intr_map_reg_t apb_adc_intr_map;
    volatile interrupt_core0_pwm0_intr_map_reg_t pwm0_intr_map;
    volatile interrupt_core0_pwm1_intr_map_reg_t pwm1_intr_map;
    volatile interrupt_core0_pcnt_intr_map_reg_t pcnt_intr_map;
    volatile interrupt_core0_parl_io_tx_intr_map_reg_t parl_io_tx_intr_map;
    volatile interrupt_core0_parl_io_rx_intr_map_reg_t parl_io_rx_intr_map;
    volatile interrupt_core0_usb_otg11_intr_map_reg_t usb_otg11_intr_map;
    volatile interrupt_core0_asrc_chnl0_intr_map_reg_t asrc_chnl0_intr_map;
    volatile interrupt_core0_asrc_chnl1_intr_map_reg_t asrc_chnl1_intr_map;
    volatile interrupt_core0_zero_det_intr_map_reg_t zero_det_intr_map;
    volatile interrupt_core0_dma_in_ch0_intr_map_reg_t dma_in_ch0_intr_map;
    volatile interrupt_core0_dma_in_ch1_intr_map_reg_t dma_in_ch1_intr_map;
    volatile interrupt_core0_dma_in_ch2_intr_map_reg_t dma_in_ch2_intr_map;
    volatile interrupt_core0_dma_in_ch3_intr_map_reg_t dma_in_ch3_intr_map;
    volatile interrupt_core0_dma_in_ch4_intr_map_reg_t dma_in_ch4_intr_map;
    volatile interrupt_core0_dma_out_ch0_intr_map_reg_t dma_out_ch0_intr_map;
    volatile interrupt_core0_dma_out_ch1_intr_map_reg_t dma_out_ch1_intr_map;
    volatile interrupt_core0_dma_out_ch2_intr_map_reg_t dma_out_ch2_intr_map;
    volatile interrupt_core0_dma_out_ch3_intr_map_reg_t dma_out_ch3_intr_map;
    volatile interrupt_core0_dma_out_ch4_intr_map_reg_t dma_out_ch4_intr_map;
    volatile interrupt_core0_gpspi2_intr_map_reg_t gpspi2_intr_map;
    volatile interrupt_core0_gpspi3_intr_map_reg_t gpspi3_intr_map;
    volatile interrupt_core0_aes_intr_map_reg_t aes_intr_map;
    volatile interrupt_core0_sha_intr_map_reg_t sha_intr_map;
    volatile interrupt_core0_ecc_intr_map_reg_t ecc_intr_map;
    volatile interrupt_core0_ecdsa_intr_map_reg_t ecdsa_intr_map;
    volatile interrupt_core0_km_intr_map_reg_t km_intr_map;
    volatile interrupt_core0_int_status_reg_0_reg_t int_status_reg_0;
    volatile interrupt_core0_int_status_reg_1_reg_t int_status_reg_1;
    volatile interrupt_core0_int_status_reg_2_reg_t int_status_reg_2;
    volatile interrupt_core0_int_status_reg_3_reg_t int_status_reg_3;
    volatile interrupt_core0_src_pass_in_sec_status_0_reg_t src_pass_in_sec_status_0;
    volatile interrupt_core0_src_pass_in_sec_status_1_reg_t src_pass_in_sec_status_1;
    volatile interrupt_core0_src_pass_in_sec_status_2_reg_t src_pass_in_sec_status_2;
    volatile interrupt_core0_src_pass_in_sec_status_3_reg_t src_pass_in_sec_status_3;
    volatile interrupt_core0_sig_idx_assert_in_sec_reg_t sig_idx_assert_in_sec;
    volatile interrupt_core0_secure_status_reg_t secure_status;
    volatile interrupt_core0_clock_gate_reg_t clock_gate;
    uint32_t reserved_1b4[402];
    volatile interrupt_core0_interrupt_date_reg_t interrupt_date;
} interrupt_core0_dev_t;

extern interrupt_core0_dev_t INTMTX0;
extern interrupt_core0_dev_t INTMTX1;

#ifndef __cplusplus
_Static_assert(sizeof(interrupt_core0_dev_t) == 0x800, "Invalid size of interrupt_core0_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
